In [2]:
# Dependencies and Setup
import pandas as pd

In [3]:
# File to Load 
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [4]:
# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load, encoding="ISO-8859-1")
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
student_data = pd.read_csv(student_data_to_load, encoding="ISO-8859-1")
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
sdc=school_data_complete 
sdc.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [29]:

school_total_summary = sdc[["school_name","Student ID","budget","math_score","reading_score"]]
school_total_summary.head()

         school_name  Student ID   budget  math_score  reading_score
0  Huang High School           0  1910635          79             66
1  Huang High School           1  1910635          61             94
2  Huang High School           2  1910635          60             90
3  Huang High School           3  1910635          58             67
4  Huang High School           4  1910635          84             97

In [25]:
school_total=sdc["school_name"].nunique()
school_total
student_total=sdc["Student ID"].nunique()
student_total
budget_total=sdc["budget"].mean()
budget_total
math_average=sdc["math_score"].mean()
math_average
reading_average=sdc["reading_score"].mean()
reading_average

81.87784018381414

In [ ]:
totalof_stu_sc_b=

In [27]:
school_total_df= sdc[["school_name","Student ID","budget","math_score","reading_score"]]
school_total_df.head()

         school_name  Student ID   budget  math_score  reading_score
0  Huang High School           0  1910635          79             66
1  Huang High School           1  1910635          61             94
2  Huang High School           2  1910635          60             90
3  Huang High School           3  1910635          58             67
4  Huang High School           4  1910635          84             97

In [ ]:
school_total_df.groupby(["student ID","math_score","reading_score"])

In [8]:
pass_math=sdc["math_score"]>=70
pass_math.head()

0     True
1    False
2    False
3    False
4     True
Name: math_score, dtype: bool

In [9]:
pass_reading=sdc["reading_score"]>=70
pass_reading.head()

0    False
1     True
2     True
3    False
4     True
Name: reading_score, dtype: bool

In [10]:
sdc.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [11]:
#Calculate the percentage of students with a passing math score (70 or greater)
sdc["math_pass"]=sdc["math_score"]>70 
(sdc["math_pass"].sum()/sdc["math_score"].sum()) *100

0.9165258769232063

In [12]:
only_math_pass=sdc["math_pass"].value_counts()
only_math_pass

True     28356
False    10814
Name: math_pass, dtype: int64

In [13]:
sdc["math_pass"].sum()

28356

In [14]:
sdc["math_score"].sum()

3093857

In [16]:
grouped_math = sdc.groupby(["math_score"])
print(grouped_math)
grouped_math.count().head()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001FA6FD61B20>

,Student ID,student_name,gender,grade,school_name,reading_score,School ID,type,size,budget,math_pass
math_score,,,,,,,,,,,
55,574,574,574,574,574,574,574,574,574,574,574
56,584,584,584,584,584,584,584,584,584,584,584
57,617,617,617,617,617,617,617,617,617,617,617
58,601,601,601,601,601,601,601,601,601,601,601
59,583,583,583,583,583,583,583,583,583,583,583
60,603,603,603,603,603,603,603,603,603,603,603
61,633,633,633,633,633,633,633,633,633,633,633
62,610,610,610,610,610,610,610,610,610,610,610
63,619,619,619,619,619,619,619,619,619,619,619
64,558,558,558,558,558,558,558,558,558,558,558

In [22]:
student_pass_math = grouped_math['student_name'].sum()
student_pass_math.head()

math_score
55    Donald ZamoraKelly JamesKari MillerChristopher...
56    Jennifer HessMadeline Snyder MDElizabeth Parke...
57    Kimberly DavisJason ThompsonLindsey BakerJason...
58    Dr. Richard ScottTracey OconnorKevin MartinezG...
59    Denise BradfordNicole ThomasJordan BeasleyVict...
Name: student_name, dtype: object